artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSolidFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5;

deltaT          0.1;

maxCo           1.0;
maxDi           10.0;

adjustTimeStep  no;

writeControl    runTime;
writeInterval   0.5;

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable true;

functions
{
    ecmCoupling
    {
        type            ecmCoupler;
        libs            ( "libecmCouplingFunctionObjects.so" );

        executeControl  timeStep;
        writeControl    writeTime;
        region          jellyRoll;
        zone            jellyRoll;

        T               T;

        qField          ecmQdot;
        stField         ecmST;
        outputMode      volumetricHeat;

        couplingMode    lumped;
        lumpedOutput    totalPower;

        parallelMode    masterGather;
        keyMode         globalCellId;

        relaxation      0.5;
        writeFields     false;
        lastGoodFile    "ecm/ecm_last_good.bin";

        inFile          "ecm/ecm_in.bin";
        outFile         "ecm/ecm_out.bin";

        command         "ECM_IN=ecm/ecm_in.bin ECM_OUT=ecm/ecm_out.bin python3 ../../ecm/ecm_coupler.py";

        electricalInputs
        {
            current_A   79.0;
            SOC         0.50;
            T_min_K     273.15;
            T_max_K     373.15;
        }
    }

    interfaceT_jellyRoll_to_shell
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        region          jellyRoll;
        regionType      patch;
        name            jellyRoll_to_shell;
        operation       areaAverage;
        fields          (T);
        writeFields     false;
        writeControl    writeTime;
    }

    interfaceT_shell_to_jellyRoll
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        region          shell;
        regionType      patch;
        name            shell_to_jellyRoll;
        operation       areaAverage;
        fields          (T);
        writeFields     false;
        writeControl    writeTime;
    }

    interfaceT_jellyRoll_to_cap
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        region          jellyRoll;
        regionType      patch;
        name            jellyRoll_to_cap;
        operation       areaAverage;
        fields          (T);
        writeFields     false;
        writeControl    writeTime;
    }

    interfaceT_cap_to_jellyRoll
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        region          cap;
        regionType      patch;
        name            cap_to_jellyRoll;
        operation       areaAverage;
        fields          (T);
        writeFields     false;
        writeControl    writeTime;
    }

    jellyRollSlices
    {
        type            surfaces;
        libs            (sampling);
        region          jellyRoll;
        writeControl    runTime;
        writeInterval   100;

        surfaceFormat   vtk;
        fields          (T ecmQdot);
        interpolationScheme cellPoint;

        surfaces
        {
            axial_x0
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0.03);
                    normal  (1 0 0);
                }
                interpolate     true;
            }
            axial_z1
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0.010);
                    normal  (0 0 1);
                }
                interpolate     true;
            }
            axial_z2
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0.020);
                    normal  (0 0 1);
                }
                interpolate     true;
            }
            axial_z3
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0.030);
                    normal  (0 0 1);
                }
                interpolate     true;
            }
            axial_z4
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0.040);
                    normal  (0 0 1);
                }
                interpolate     true;
            }
            axial_z5
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0.050);
                    normal  (0 0 1);
                }
                interpolate     true;
            }
        }
    }
}

// ************************************************************************* //
