artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-14 -14 -3)
    ( 14 -14 -3)
    ( 14  14 -3)
    (-14  14 -3)
    (-14 -14 73)
    ( 14 -14 73)
    ( 14  14 73)
    (-14  14 73)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (28 28 76) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    minX
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    maxX
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    minY
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    maxY
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    minZ
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
