artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/0/ambient/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/ambient";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxX
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    minY
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxY
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    minZ
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxZ
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ambient_to_shell
    {
        type            noSlip;
    }
    ambient_to_cap
    {
        type            noSlip;
    }
}

// ************************************************************************* //
