artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/0/cap/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/cap";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    externalWall
    {
        type            calculated;
        value           uniform 0;
    }
    cap_to_jellyRoll
    {
        type            calculated;
        value           uniform 0;
    }
    cap_to_shell
    {
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
