artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/0/cap/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/cap";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14720
(
7.0589829e-11
1.4475211e-10
1.2454202e-10
1.237265e-10
1.2464515e-10
1.2416291e-10
1.6760782e-10
1.1686477e-10
...
)
;

boundaryField
{
    externalWall
    {
        type            calculated;
        value           uniform 0;
    }
    cap_to_jellyRoll
    {
        type            calculated;
        value           uniform 0;
    }
    cap_to_shell
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
