artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/0/jellyRoll/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/jellyRoll";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
49784
(
6.414249e-11
1.361722e-10
1.3559214e-10
1.4443958e-10
1.4830797e-10
1.3902934e-10
1.701626e-10
1.1052845e-10
...
)
;

boundaryField
{
    jellyRoll_to_cap
    {
        type            calculated;
        value           uniform 0;
    }
    jellyRoll_to_shell
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
