artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/0/shell/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/shell";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
33412
(
4.8536098e-11
1.1961543e-10
1.0964409e-10
1.163708e-10
1.1751332e-10
1.1143233e-10
1.2970297e-10
8.6720633e-11
...
)
;

boundaryField
{
    externalWall
    {
        type            calculated;
        value           uniform 0;
    }
    shell_to_jellyRoll
    {
        type            calculated;
        value           uniform 0;
    }
    shell_to_cap
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
