artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/system/sampleLine
// -*- C++ -*-

sampleLine
{
    type            sets;
    libs            (sampling);
    setFormat       raw;
    writeControl    writeTime;
    interpolationScheme cellPoint;
    fields          (T);

    sets
    {
        axisLine
        {
            type    uniform;
            axis    xyz;
            start   (0 0 0);
            end     (0 0 0.07);
            nPoints 200;
        }
    }
}

// ************************************************************************* //
