artifacts/packs/consultant_lumped_solid_debug_20260325_131023/cases/lumped_solid/Allmesh
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite
runApplication splitMeshRegions -cellZones -overwrite

#------------------------------------------------------------------------------
